//
// Created by 周洋 on 2020/5/8.
//模块驱动操作接口，此文件使用底层驱动函数，连接不同的底层驱动平台，实现模块驱动代码与硬件的分离
//

#include "module_opts.h"

/*
===========================================================================================
* 功    能：模块使用的微秒延时接口
* 输    入：nus：需要延时的微秒数
* 输    出：无
===========================================================================================
 */
void mod_delay_us(u32 nus)
{
	delay_us(nus);//调用硬件平台实现的微秒延时
}

/*
===========================================================================================
* 功    能：模块使用的毫秒延时接口
* 输    入：nms：需要延时的毫秒数
* 输    出：无
===========================================================================================
 */
void mod_delay_ms(u32 nms)
{
	delay_ms(nms);//调用硬件平台实现的毫秒延时
}

/*
===========================================================================================
* 功    能：模块使用的IO初始化接口
* 输    入：io：需要初始化的IO实例
* 输    出：无
===========================================================================================
 */
void mod_IoInit(_io *io)
{
	bsp_IoInit(io);
}

/*
===========================================================================================
* 功    能：模块使用的IO方向设置接口
* 输    入：io：需要设置方向的IO实例; dir:需要设置的方向 0---输入   1---输出
* 输    出：无
===========================================================================================
 */
void mod_IoSetDir(_io *io,u8 dir)
{
	if(dir)
		io->mode = IO_MODE_OUT_PP_50MHZ;
	else
		io->mode = IO_MODE_IN_PULL;
	bsp_IoInit(io);
}

/*
===========================================================================================
* 功    能：模块使用的IO输出电平设置接口
* 输    入：io：需要设置输出电平的IO实例; dir:需要输出的电平 0---低电平   1---高电平
* 输    出：无
===========================================================================================
 */
void mod_IoSetVal(_io *io,u8 val)
{
	if(val)
		bsp_IoSet(io);
	else
		bsp_IoClr(io);
}

/*
===========================================================================================
* 功    能：模块使用的IO入电平获取接口
* 输    入：io：需要获取输入电平的IO实例;
* 输    出：io口当前输入电平
===========================================================================================
 */
u8 mod_IoGetVal(_io *io)
{
	return bsp_IoRead(io);
}
