//
// Created by 周洋 on 2020/5/8.
//

#include "esp8266.h"

/*
===========================================================================================
* 功    能：初始化wifi模块通信串口
* 输    入：esp：wifi模块配置参数
* 输    出：无
===========================================================================================
 */
void mod_Esp8266Init(_esp8266 *esp)
{
	esp->util = CreateDataUtil(DataUtil_UART, &esp->para);
}

/*
===========================================================================================
* 功    能：发送esp8266模块复位指令
* 输    入：esp：8266模块实例,需要操作的8266模块对象
* 输    出：无
===========================================================================================
 */
void mod_Esp8266Rst(_esp8266 *esp)
{
	sprintf((char *) esp->msg, "AT+RST\r\n");
	esp->util->write(esp->msg, strlen((char *) esp->msg));
}

/*
===========================================================================================
* 功    能：配置8266模块运行模式
* 输    入：esp：8266模块实例,需要操作的8266模块对象
* 输    出：无
===========================================================================================
 */
void mod_Esp8266CfgMode(_esp8266 *esp, _Esp8266Mode mode)
{
	sprintf((char *) esp->msg, "AT+CWMODE=%d\r\n", mode);
	esp->util->write(esp->msg, strlen((char *) esp->msg));
}

/*
===========================================================================================
* 功    能：8266模块连接路由器
* 输    入：esp：8266模块实例,需要操作的8266模块对象
 * ssid:路由器名称
 * passwd:路由器密码
* 输    出：无
===========================================================================================
 */
void mod_Esp8266LinkRouter(_esp8266 *esp, char *ssid, char *passwd)
{
	sprintf((char *) esp->msg, "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, passwd);
	esp->util->write(esp->msg, strlen((char *) esp->msg));
}

/*
===========================================================================================
* 功    能：8266模块连接tcp服务端
* 输    入：esp：8266模块实例,需要操作的8266模块对象
* 输    出：无
===========================================================================================
 */
void mod_Esp8266LinkServer(_esp8266 *esp)
{
	sprintf((char *) esp->msg, "AT+CIPSTART=\"TCP\", \"%d.%d.%d.%d\",%d\r\n", esp->serverIp.ip1, esp->serverIp.ip2,
			esp->serverIp.ip3, esp->serverIp.ip4, esp->serverIp.port);
	esp->util->write(esp->msg, strlen((char *) esp->msg));
}

/*
===========================================================================================
* 功    能：8266模块使能透传模式
* 输    入：esp：8266模块实例,需要操作的8266模块对象
* 输    出：无
===========================================================================================
 */
void mod_Esp8266EnterTransfr(_esp8266 *esp)
{
	sprintf((char *) esp->msg, "AT+CIPMODE=1\r\n");
	esp->util->write(esp->msg, strlen((char *) esp->msg));
}

/*
===========================================================================================
* 功    能：开始在透传模式发送数据
* 输    入：esp：8266模块实例,需要操作的8266模块对象
* 输    出：无
===========================================================================================
 */
void mod_Esp8266StartSend(_esp8266 *esp)
{
	sprintf((char *) esp->msg, "AT+CIPSEN\r\n");
}

/*
===========================================================================================
* 功    能：通过esp8266发送数据（连接成功后透传时使用）
* 输    入：esp：wifi模块配置参数
* 输    出：无
===========================================================================================
 */
void mod_Esp8266Send(_esp8266 *esp)
{
	esp->util->write(esp->msg, esp->msgLen);
}

